<template math>
  <svg style="display: none">
    <symbol viewBox="0 0 1536 1536" id="ico-fs-expand">
      <path
        d="M1283 413L928 768l355 355 144-144q29-31 70-14 39 17 39 59v448q0 26-19 45t-45 19h-448q-42 0-59-40-17-39 14-69l144-144-355-355-355 355 144 144q31 30 14 69-17 40-59 40H64q-26 0-45-19t-19-45v-448q0-42 40-59 39-17 69 14l144 144 355-355-355-355-144 144q-19 19-45 19-12 0-24-5-40-17-40-59V64q0-26 19-45T64 0h448q42 0 59 40 17 39-14 69L413 253l355 355 355-355-144-144q-31-30-14-69 17-40 59-40h448q26 0 45 19t19 45v448q0 42-39 59-13 5-25 5-26 0-45-19z">
      </path>
    </symbol>
    <symbol viewBox="0 0 1536 1536" id="ico-fs-shrink">
      <path
        d="M768 832v448q0 26-19 45t-45 19-45-19l-144-144-332 332q-10 10-23 10t-23-10L23 1399q-10-10-10-23t10-23l332-332-144-144q-19-19-19-45t19-45 45-19h448q26 0 45 19t19 45zm755-672q0 13-10 23l-332 332 144 144q19 19 19 45t-19 45-45 19H832q-26 0-45-19t-19-45V256q0-26 19-45t45-19 45 19l144 144 332-332q10-10 23-10t23 10l114 114q10 10 10 23z">
      </path>
    </symbol>
    <symbol viewBox="0 0 35 35" id="ico-linkedin">
      <title>linkedin</title>
      <path
        d="M17.5 0C7.8 0 0 7.8 0 17.5S7.8 35 17.5 35 35 27.2 35 17.5C35 7.8 27.2 0 17.5 0zM13.1 26H8.8V10.7h4.4V26zM11.1 9.7c-1.1 0-2-0.9-2-2.1s0.9-2.1 2.1-2.1c1.1 0 2.1 0.9 2.1 2.1C13.1 8.8 12.2 9.7 11.1 9.7zM28.4 26h-4.4V16.5c0-1.1-0.3-1.9-1.7-1.9 -2.3 0-2.7 1.9-2.7 1.9v9.5h-4.4V10.7h4.4v1.5c0.6-0.5 2.2-1.5 4.4-1.5 1.4 0 4.4 0.8 4.4 6V26z">
      </path>
    </symbol>
    <symbol viewBox="0 0 35 35" id="ico-facebook">
      <title>facebook</title>
      <path
        d="M17.5 0C7.8 0 0 7.8 0 17.5S7.8 35 17.5 35 35 27.2 35 17.5C35 7.8 27.2 0 17.5 0zM23.6 9.6h-2.2c-0.8 0-1.4 0.2-1.6 0.5 -0.3 0.3-0.4 0.9-0.4 1.5v2.7h4.2l-0.5 4.2h-3.6v10.8h-4.3V18.5h-3.6V14.3h3.6v-3.1c0-1.8 0.5-3.1 1.5-4.1 1-1 2.3-1.5 3.9-1.5 1.4 0 2.5 0.1 3.2 0.2C23.6 5.9 23.6 9.6 23.6 9.6z">
      </path>
    </symbol>
    <symbol viewBox="0 0 35 35" id="ico-instagram">
      <title>instagram</title>
      <path
        d="M17.5 21c1.9 0 3.5-1.6 3.5-3.5 0-0.8-0.2-1.5-0.7-2 -0.6-0.9-1.7-1.5-2.8-1.5s-2.2 0.6-2.8 1.5c-0.4 0.6-0.7 1.3-0.7 2C14 19.4 15.6 21 17.5 21z">
      </path>
      <polygon points="25.2 13.2 25.2 10.3 25.2 9.8 24.7 9.8 21.8 9.9 21.8 13.2 "></polygon>
      <path
        d="M17.5 0C7.9 0 0 7.9 0 17.5S7.9 35 17.5 35 35 27.1 35 17.5 27.2 0 17.5 0zM27.5 15.5v8.1c0 2.1-1.7 3.8-3.8 3.8H11.4c-2.1 0-3.8-1.7-3.8-3.8v-8.1 -4.1c0-2.1 1.7-3.8 3.8-3.8h12.2c2.1 0 3.8 1.7 3.8 3.8L27.5 15.5 27.5 15.5z">
      </path>
      <path
        d="M22.9 17.5c0 3-2.4 5.4-5.4 5.4s-5.4-2.4-5.4-5.4c0-0.7 0.1-1.4 0.4-2H9.5v8.1c0 1.1 0.9 1.9 1.9 1.9h12.2c1.1 0 1.9-0.9 1.9-1.9v-8.1h-3C22.8 16.1 22.9 16.8 22.9 17.5z">
      </path>
    </symbol>
    <symbol viewBox="0 0 35 35" id="ico-twitter">
      <title>twitter</title>
      <path
        d="M17.5 0C7.8 0 0 7.8 0 17.5S7.8 35 17.5 35 35 27.2 35 17.5C35 7.8 27.2 0 17.5 0zM26.2 13.6l0 0.6c0 5.7-4.3 12.3-12.3 12.3 -2.4 0-4.7-0.7-6.6-1.9 0.3 0 0.7 0.1 1 0.1 2 0 3.9-0.7 5.4-1.8 -1.9 0-3.5-1.3-4-3 0.3 0.1 0.5 0.1 0.8 0.1 0.4 0 0.8 0 1.1-0.1 -2-0.4-3.5-2.1-3.5-4.2v-0.1c0.6 0.3 1.2 0.5 2 0.5 -1.2-0.8-1.9-2.1-1.9-3.6 0-0.8 0.2-1.5 0.6-2.2 2.1 2.6 5.3 4.3 8.9 4.5 -0.1-0.3-0.1-0.6-0.1-1 0-2.4 1.9-4.3 4.3-4.3 1.2 0 2.4 0.5 3.1 1.4 1-0.2 1.9-0.6 2.7-1 -0.3 1-1 1.9-1.9 2.4 0.9-0.1 1.7-0.3 2.5-0.7C27.8 12.2 27 13 26.2 13.6z">
      </path>
    </symbol>
    <symbol viewBox="0 0 35 35" id="ico-youtube">
      <title>youtube</title>
      <path
        d="M15.2 24.5c0 0.3 0 0.5 0 0.6 0 0.2 0 0.2-0.1 0.3 0 0.2-0.2 0.3-0.4 0.4 -0.2 0.1-0.3 0-0.5-0.3 0 0 0-0.1 0-0.3 0-0.2 0-0.4 0-0.6l0-3.8h-1.4l0 3.8c0 0.3 0 0.5 0 0.7s0 0.4 0 0.5c0 0.2 0 0.3 0.1 0.5 0 0.2 0.1 0.3 0.3 0.5 0.2 0.1 0.4 0.2 0.6 0.2 0.2 0 0.4 0 0.7-0.1 0.2-0.1 0.4-0.2 0.6-0.3 0.2-0.1 0.3-0.3 0.4-0.4l0 0.8L16.7 26.8v-6.1h-1.4L15.2 24.5 15.2 24.5z">
      </path>
      <path
        d="M20.1 20.5c-0.3 0-0.7 0.2-1.2 0.5V18.6h-1.4v8.2l1.2 0 0.1-0.5c0.4 0.3 0.7 0.5 1 0.6 0.3 0.1 0.6 0 0.8-0.1 0.2-0.1 0.4-0.3 0.5-0.6 0.1-0.3 0.2-0.6 0.2-1v-3.2c0-0.6-0.2-1-0.6-1.3C20.5 20.5 20.3 20.5 20.1 20.5zM20.2 25.3c0 0.1-0.1 0.2-0.2 0.3 -0.1 0.1-0.3 0.1-0.4 0.1 -0.2 0-0.3 0-0.4-0.1 -0.1-0.1-0.2-0.2-0.2-0.3v-3.6c0-0.1 0.1-0.2 0.2-0.3 0.1-0.1 0.3-0.1 0.4-0.1 0.2 0 0.3 0 0.4 0.1 0.1 0.1 0.2 0.2 0.2 0.3V25.3z">
      </path>
      <polygon points="13.2 18.6 8.6 18.6 8.6 19.6 10.1 19.6 10.1 26.8 11.5 26.8 11.5 19.6 13.2 19.6 "></polygon>
      <path
        d="M17.5 0C7.8 0 0 7.8 0 17.5S7.8 35 17.5 35 35 27.2 35 17.5C35 7.8 27.2 0 17.5 0zM20 12.7V8.5h1.3v4.9c0 0.1 0 0.2 0.1 0.3 0.1 0.1 0.2 0.1 0.4 0.1 0.1 0 0.3 0 0.4-0.1 0.1-0.1 0.2-0.2 0.2-0.3V8.5h1.2v6.3h-1.6l0-0.5c-0.1 0.2-0.3 0.4-0.4 0.5 -0.2 0.1-0.3 0.2-0.5 0.2 -0.2 0-0.4-0.1-0.6-0.2 -0.1-0.1-0.3-0.2-0.4-0.4 0-0.1-0.1-0.2-0.1-0.3 0-0.1 0-0.2 0-0.3 0-0.1 0-0.2 0-0.4L20 12.7 20 12.7zM16.1 8.6c0.3-0.2 0.6-0.3 1.1-0.3 0.4 0 0.7 0.1 1 0.2 0.3 0.1 0.5 0.3 0.6 0.5 0.1 0.2 0.2 0.4 0.3 0.6 0.1 0.3 0.1 0.6 0.1 1v1.6c0 0.6 0 1-0.1 1.3 0 0.2-0.1 0.5-0.3 0.8 -0.2 0.3-0.4 0.4-0.6 0.5 -0.3 0.1-0.6 0.2-0.9 0.2 -0.3 0-0.7 0-0.9-0.2 -0.3-0.1-0.5-0.2-0.6-0.4 -0.1-0.2-0.2-0.4-0.3-0.7 -0.1-0.3-0.1-0.7-0.1-1.3 0 0 0-1.7 0-1.7 0-0.6 0.1-1 0.2-1.4C15.6 9 15.8 8.7 16.1 8.6zM11.9 6l0.9 3.1 0.9-3.1h1.7l-1.8 4.2v4.8H12.2v-4.8l-1.9-4.2H11.9zM27.8 26c0 0.4-0.1 0.8-0.3 1.2 -0.2 0.4-0.4 0.7-0.7 0.9 -0.3 0.3-0.7 0.5-1.1 0.6 -0.4 0.2-0.8 0.2-1.3 0.2H10.6c-0.5 0-0.9-0.1-1.3-0.2 -0.4-0.2-0.8-0.4-1.1-0.6 -0.3-0.3-0.6-0.6-0.7-0.9 -0.2-0.4-0.3-0.7-0.3-1.2v-6.8c0-0.4 0.1-0.8 0.3-1.2 0.2-0.4 0.4-0.7 0.7-0.9 0.3-0.3 0.7-0.5 1.1-0.6 0.4-0.2 0.8-0.2 1.3-0.2H24.4c0.5 0 0.9 0.1 1.3 0.2s0.8 0.4 1.1 0.6c0.3 0.3 0.6 0.6 0.7 0.9 0.2 0.4 0.3 0.7 0.3 1.2V26z">
      </path>
      <path
        d="M17.2 13.9c0.2 0 0.3-0.1 0.4-0.2 0.1-0.1 0.2-0.3 0.2-0.4V9.9c0-0.2-0.1-0.3-0.2-0.5 -0.1-0.1-0.3-0.2-0.4-0.2 -0.2 0-0.3 0.1-0.4 0.2 -0.1 0.1-0.2 0.3-0.2 0.5v3.4c0 0.2 0.1 0.3 0.2 0.4C16.9 13.9 17.1 13.9 17.2 13.9z">
      </path>
      <path
        d="M24.7 24.7v0.2 0.5c0 0.2-0.1 0.3-0.2 0.4 -0.1 0.1-0.3 0.1-0.4 0.1h-0.2c-0.2 0-0.3 0-0.4-0.1 -0.1-0.1-0.2-0.2-0.2-0.4v-0.1 -0.6 -0.8h2.5v-0.8c0-0.3 0-0.6 0-0.9 0-0.3 0-0.5-0.1-0.7 0-0.3-0.2-0.5-0.4-0.7 -0.2-0.2-0.5-0.3-0.7-0.3 -0.3-0.1-0.6-0.1-0.9 0 -0.3 0-0.5 0.1-0.8 0.3 -0.3 0.2-0.5 0.4-0.6 0.8 -0.1 0.3-0.2 0.8-0.2 1.3v1.9c0 0.8 0.2 1.4 0.6 1.7 0.4 0.3 0.8 0.5 1.2 0.5 0 0 0.1 0 0.1 0 0.5 0 0.9-0.2 1.3-0.6 0.3-0.3 0.4-0.6 0.4-1.1 0-0.1 0-0.3-0.1-0.5H24.7v0h0V24.7zM23.3 22.1c0-0.2 0.1-0.3 0.2-0.4 0.1-0.1 0.3-0.2 0.4-0.2h0.1c0.2 0 0.3 0.1 0.5 0.2 0.1 0.1 0.2 0.2 0.2 0.4l0 0.8h-1.4L23.3 22.1z">
      </path>
    </symbol>
    <symbol viewBox="0 0 112.2 112.2" width="35" height="35" id="ico-pinterest">
      <circle cx="56.1" cy="56.1" r="56.1"></circle>
      <path
        d="M60.6 75.1c-4.2-0.3-6-2.4-9.3-4.4 -1.8 9.6-4.1 18.8-10.7 23.6 -2-14.5 3-25.4 5.3-36.9 -4-6.7 0.5-20.2 8.9-16.9 10.4 4.1-9 25 4 27.6 13.6 2.7 19.1-23.5 10.7-32 -12.1-12.3-35.3-0.3-32.5 17.4 0.7 4.3 5.2 5.6 1.8 11.6 -7.8-1.7-10.1-7.8-9.8-16 0.5-13.4 12-22.7 23.6-24 14.6-1.6 28.4 5.4 30.3 19.1C85 59.5 76.3 76.3 60.6 75.1L60.6 75.1z"
        fill="#fff"></path>
    </symbol>
    <symbol viewBox="0 0 100 70" id="logo-edx">
      <title>logo-edx</title>
      <g>
        <g>
          <path d="M19.25,44.898V30.376h3.838c0.895,0,1.579,0.043,2.051,0.129c0.662,0.11,1.217,0.32,1.665,0.63
                c0.448,0.31,0.808,0.744,1.081,1.301c0.273,0.558,0.409,1.171,0.409,1.839c0,1.147-0.365,2.117-1.094,2.911
                c-0.73,0.794-2.048,1.191-3.955,1.191h-2.21v6.521H19.25z M21.034,36.786h2.238c1.153,0,1.971-0.215,2.455-0.644
                c0.484-0.429,0.727-1.033,0.727-1.812c0-0.564-0.143-1.047-0.428-1.448c-0.285-0.401-0.661-0.667-1.127-0.795
                c-0.3-0.08-0.855-0.12-1.664-0.12h-2.201V36.786z"></path>
          <path d="M30.446,44.898V30.376h9.125v1.591H32.23v4.545h7.043v1.582H32.23v5.213h7.653v1.591H30.446z"></path>
          <path d="M42.078,44.898V30.376h1.83l8.121,11.625V30.376h1.711v14.522h-1.83l-8.121-11.634v11.634H42.078z">
          </path>
          <g>
            <path d="M15.034,32.17c1.454,1.485,2.181,3.277,2.181,5.374c0,2.098-0.727,3.889-2.181,5.374
                  c-1.454,1.485-3.208,2.228-5.263,2.228c-2.054,0-3.808-0.743-5.263-2.228c-1.454-1.485-2.181-3.277-2.181-5.374
                  c0-2.098,0.727-3.889,2.181-5.374c1.454-1.485,3.208-2.228,5.263-2.228C11.825,29.942,13.579,30.685,15.034,32.17z
                   M9.771,31.882c-1.533,0-2.84,0.552-3.922,1.657c-1.082,1.105-1.622,2.44-1.622,4.005c0,1.566,0.542,2.902,1.627,4.01
                  c1.085,1.108,2.39,1.661,3.918,1.661c1.533,0,2.84-0.554,3.922-1.661c1.082-1.108,1.622-2.444,1.622-4.01
                  c0-1.565-0.541-2.901-1.622-4.005C12.612,32.434,11.304,31.882,9.771,31.882z"></path>
          </g>
        </g>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M78.941,25.841c0,0.994,0,2.983,0,2.983l1.585,0.023
              c0,0,0.213,0.259,0.326,0.379c0,0.008,0-0.014,0-0.007c0,3.946,0,7.891,0,11.837c0,0.008,0,0.016,0,0.023
              c-0.176,0.196-0.323,0.423-0.513,0.606c-0.492,0.018-0.914-0.034-1.398-0.023c0,1.025,0,2.051,0,3.076c-0.373,0-0.746,0-1.118,0
              c0-0.427,0-0.854,0-1.282c-0.939,0.614-2.14,1.169-3.658,1.282c-0.311,0-0.621,0-0.932,0c-2.234-0.197-3.734-1.128-4.94-2.353
              c0-0.008,0-0.016,0-0.023c0.545-0.589,0.985-1.283,1.305-2.097c-0.878,0-1.755,0-2.633,0c-0.008,0-0.015,0-0.023,0
              c-0.197-0.509-0.379-1.035-0.466-1.654c0-0.008,0-0.016,0-0.023c0.996,0.037,2.046,0.02,3.076,0.023c0.008,0,0.016,0,0.023,0
              c0.551,1.827,2.321,3.419,4.777,3.029c1.864-0.296,3.347-1.851,3.472-3.868c0.095-1.527-0.421-2.573-1.188-3.355
              c-0.635-0.647-1.444-1.175-2.586-1.258c-2.185-0.159-3.382,0.979-4.148,2.26c-0.008,0-0.016,0-0.023,0
              c-0.302-1.197-0.865-2.133-1.561-2.936c0-0.008,0-0.016,0-0.023c1.001-1.111,2.424-1.997,4.311-2.284
              c2.091-0.318,3.925,0.313,5.196,1.212c0-0.839,0-1.678,0-2.517c-0.614-0.054-1.328-0.008-1.981-0.023c0-1.002,0-2.004,0-3.006
              C76.875,25.841,77.908,25.841,78.941,25.841z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd"
          d="M78.941,25.841c0.637,0,1.274,0,1.911,0
              c0,1.118,0,2.267,0,3.385c-0.116-0.118-0.326-0.379-0.326-0.379l-1.585-0.023C78.941,28.824,78.941,26.836,78.941,25.841z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M80.851,25.841c1.856,0,3.713,0,5.569,0
              c0,0.994,0,1.988,0,2.983c-0.552,0.016-1.165-0.031-1.678,0.023c0.994,1.243,1.996,2.478,3.006,3.705
              c0.996-1.225,1.992-2.45,2.983-3.682c0.023-0.001,0.018-0.029,0.023-0.047c-0.559,0-1.118,0-1.678,0c0-0.994,0-1.988,0-2.983
              c2.486,0,4.971,0,7.456,0c0,0.994,0,1.988,0,2.983c-0.52,0.016-1.103-0.031-1.584,0.023c-1.729,2.062-3.401,4.18-5.103,6.268
              c1.735,2.211,3.529,4.363,5.289,6.548c0.466,0,0.932,0,1.398,0c0,1.025,0,2.051,0,3.076c-2.486,0-4.971,0-7.456,0
              c0-1.025,0-2.051,0-3.076c0.621,0,1.243,0,1.864,0c-0.997-1.294-2.138-2.647-3.192-3.961c-1.076,1.317-2.141,2.643-3.216,3.961
              c0.629,0,1.258,0,1.887,0c0,1.025,0,2.051,0,3.076c-1.087,0-2.175,0-3.262,0c0-1.018,0-2.035,0-3.052
              c-0.716-0.013-1.546-0.008-2.307-0.023c0-0.194,0-0.388,0-0.582c0-0.008,0-0.016,0-0.023c1.606-1.967,3.203-3.943,4.8-5.919
              c-1.583-1.99-3.186-3.96-4.8-5.919c0-0.008,0-0.016,0-0.023C80.851,28.078,80.851,26.96,80.851,25.841z">
        </path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M84.743,28.847c0.513-0.054,1.126-0.008,1.678-0.023
              C85.908,28.878,85.294,28.832,84.743,28.847z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M89.077,28.824c0.559,0,1.118,0,1.678,0
              c-0.005,0.018-0.001,0.046-0.023,0.047C90.234,28.801,89.574,28.894,89.077,28.824z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M94.949,28.847c0.482-0.054,1.064-0.008,1.584-0.023
              C96.052,28.878,95.469,28.832,94.949,28.847z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M62.7,30.106c0.14-0.039,0.442-0.039,0.582,0
              C63.088,30.106,62.894,30.106,62.7,30.106z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M58.039,32.016c1.175-1.015,2.571-1.809,4.66-1.911
              c0.194,0,0.388,0,0.582,0c2.056,0.095,3.424,0.879,4.567,1.887c0.099,0.118,0.208,0.227,0.326,0.326
              c0.037,0.056,0.083,0.103,0.14,0.14c0,0.008,0,0.016,0,0.023c-0.754,0.769-1.303,1.742-1.654,2.913c-0.008,0-0.016,0-0.023,0
              c-0.671-1.232-1.69-2.116-3.472-2.237c-0.09-0.002-0.292-0.012-0.396,0c-1.199,0.044-1.985,0.5-2.656,1.072
              c-0.126,0.107-0.243,0.223-0.349,0.35c-0.382,0.433-0.688,0.943-0.885,1.561c2.534,0.023,5.072,0.008,7.596,0.023
              c-0.111,0.728-0.142,1.703,0,2.423c0,0.008,0,0.016,0,0.023c-2.532,0-5.064,0-7.596,0c0.456,1.466,1.424,2.513,2.936,2.913
              c1.624,0.43,3.037-0.135,3.915-0.909c0.105-0.093,0.347-0.293,0.396-0.35c0.241-0.023,0.588,0,0.816,0c0.008,0,0.016,0,0.023,0
              c0.321,0.821,0.804,1.48,1.328,2.097c0,0.008,0,0.016,0,0.023c-1.175,1.257-2.68,2.182-4.94,2.353c-0.241,0-0.481,0-0.722,0
              c-2.091-0.165-3.679-1-4.823-2.144c-1.144-1.144-1.997-2.735-2.12-4.87c0-0.202,0-0.404,0-0.606
              c0.101-2.089,0.896-3.485,1.911-4.66C57.754,32.321,57.901,32.174,58.039,32.016z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M68.315,32.482c0.696,0.803,1.259,1.739,1.561,2.936
              c-0.443,0.769-0.638,2.137-0.326,3.192c-1.03-0.003-2.079,0.013-3.076-0.023c-0.142-0.72-0.111-1.695,0-2.423
              c0.155,0,0.311,0,0.466,0c-0.019-0.238-0.18-0.535-0.28-0.769C67.012,34.224,67.561,33.251,68.315,32.482z">
        </path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M66.638,35.395c0.008,0,0.016,0,0.023,0
              c0.1,0.234,0.261,0.531,0.28,0.769c-0.155,0-0.311,0-0.466,0C66.522,35.901,66.593,35.661,66.638,35.395z">
        </path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M69.876,35.418c0.008,0,0.016,0,0.023,0
              c0.218,0.916,0.357,2.174,0.14,3.192c-0.155,0-0.311,0-0.466,0c-0.008,0-0.016,0-0.023,0
              C69.238,37.555,69.433,36.187,69.876,35.418z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M66.964,40.265c0.878,0,1.755,0,2.633,0
              c-0.32,0.814-0.76,1.508-1.305,2.097C67.768,41.745,67.284,41.086,66.964,40.265z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M80.851,41.081c0,0.194,0,0.388,0,0.582
              c0.774,0.007,1.599-0.003,2.307,0.023c0,1.017,0,2.035,0,3.052c-1.406,0-2.812,0-4.218,0c0-1.025,0-2.051,0-3.076
              c0.484-0.01,0.906,0.041,1.398,0.023C80.529,41.504,80.675,41.277,80.851,41.081z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M67.849,31.993c0.118,0.099,0.227,0.208,0.326,0.326
              C68.057,32.22,67.948,32.111,67.849,31.993z"></path>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M59.764,34.579c0.107-0.126,0.223-0.243,0.349-0.35
              C60.006,34.356,59.89,34.473,59.764,34.579z"></path>
      </g>
    </symbol>
    <symbol viewBox="0 0 100 100" id="logo-raccoon">
      <path
        d="M68.6 10.2v12.6L57.3 20.3h0L50 20.3v0l-7.2 0h0l-11.3 2.5V10.2L12.8 28.9 0.9 40.7l0 0 9.2 9.2 13.5 13.5 9.3 9.3L50 89.8v0l17.1-17.1 9.3-9.3 13.4-13.5 9.2-9.2 -11.8-11.9L68.6 10.2zM64.3 71.8l0 0L50 66.7v0l-14.3 5.2 0 0 -9.7-9.8 9.6-5.9L50 53v0l14.4 3.1 9.6 5.9L64.3 71.8zM95.3 40.7l-7.5 7.6h0l-9.5-7.5 -9.6-3.9 -7.9 3.9L50 46V45.9l-10.7-5.2 -7.9-3.9 -9.6 3.9 -9.5 7.5 0 0 -7.5-7.6 0 0 12.6-12.6 11.6-11.6 0 9.9 0.1 0 14.7-3.6 0 0H50v0h6.4l14.7 3.6 0.1 0 0-9.9L82.7 28.1l12.6 12.6V40.7z">
      </path>
    </symbol>
    <symbol viewBox="0 0 65 53" id="logo-raccoon-colored">
      <g transform="translate(-7.698 -13.369)">
        <g transform="translate(10.067 17.589)">
          <path d="M26.35,17.589l-7.915,7.886,7.876-1.284Z" transform="translate(-10.067 -17.589)" fill="#c6c6c6">
          </path>
          <path d="M18.4,25.443l-8.335,8.364,12.59.086L26.279,24.2v-.045Z" transform="translate(-10.067 -17.589)"
            fill="#dbdadb"></path>
          <path d="M15.182,39.075l7.475-5.182-12.59-.086Z" transform="translate(-10.067 -17.589)" fill="#c6c6c6"></path>
          <path d="M22.657,33.893l5.477-2.585-1.855-7.1Z" transform="translate(-10.067 -17.589)" fill="#b7b7b7"></path>
        </g>
        <path d="M26.279,24.2l1.855,7.1,4.97,2.525,7.317,3.486-4.193-15.53Z" transform="translate(-0.203 -0.058)"
          fill="#fff"></path>
        <path d="M36.228,21.789l4.193,15.53,4.307-15.53Z" transform="translate(-0.28 -0.058)" fill="#e4e4e5"></path>
        <path d="M44.728,21.789l-4.307,15.53L47.6,33.833l5.136-2.6,1.858-7.05Z" transform="translate(-0.357 -0.058)"
          fill="#b9b9b9"></path>
        <g transform="translate(52.179 17.597)">
          <path d="M54.609,17.6,54.6,24.163l7.751,1.193Z" transform="translate(-52.74 -17.597)" fill="#c6c6c6"></path>
          <path d="M52.74,31.234l6.555,2.6-4.7-9.649Z" transform="translate(-52.74 -17.597)" fill="#fff"></path>
          <path d="M62.349,25.356,54.6,24.163v.021l4.7,9.649,11.424-.085Z" transform="translate(-52.74 -17.597)"
            fill="#e9e8e9"></path>
          <path d="M59.295,33.833l6.373,5.011,5.051-5.1Z" transform="translate(-52.74 -17.597)" fill="#c6c6c6"></path>
        </g>
        <g transform="translate(15.192 31.174)">
          <path d="M15.192,39.071,24.2,48.086l6.4-3.966L22.667,33.888Z" transform="translate(-15.192 -31.303)"
            fill="#191c1a"></path>
          <path d="M22.667,33.888,30.6,44.12,28.144,31.3Z" transform="translate(-15.192 -31.303)"></path>
        </g>
        <path d="M33.114,33.828,28.144,31.3,30.6,44.12l9.831-2.095V37.314Z" transform="translate(-0.215 -0.116)"
          fill="#464749"></path>
        <path d="M47.614,33.828l-7.183,3.486v4.711l9.674,2.06L52.75,31.229Z" transform="translate(-0.345 -0.116)"
          fill="#181a19"></path>
        <g transform="translate(49.543 31.101)">
          <path d="M52.75,31.229,50.1,44.085l9.2-10.257Z" transform="translate(-50.104 -31.229)" fill="#393b3c"></path>
          <path d="M59.305,33.828,50.1,44.085l6.446,3.973,9.183-9.181Z" transform="translate(-50.104 -31.229)"
            fill="#46474a"></path>
        </g>
        <path d="M24.214,48.025l6.571,6.651,9.644-3.57-9.766-7.054Z" transform="translate(-0.188 -0.189)"
          fill="#b9b9b9"></path>
        <path d="M30.663,44.052l9.766,7.054.065-9.15Z" transform="translate(-0.231 -0.17)" fill="#e4e4e5"></path>
        <path d="M40.494,41.956l-.065,9.15,9.738-7.089Z" transform="translate(-0.329 -0.17)" fill="#e4e4e5"></path>
        <path d="M50.167,44.017l-9.738,7.089L50.055,54.6l6.656-6.531Z" transform="translate(-0.373 -0.188)" fill="#fff">
        </path>
        <path d="M30.668,54.659l9.762,9.834V51.106Z" transform="translate(-0.231 -0.262)" fill="#181a19"></path>
        <path d="M40.429,51.106V64.493l9.762-9.849Z" transform="translate(-0.329 -0.262)" fill="#46474a"></path>
        <path d="M10.067,33.807l8.37-8.369-2.745.449L7.7,33.881l2.38-.064Z" transform="translate(0 -0.071)"
          fill="#464749"></path>
        <path d="M36.228,21.789h8.5l.008,0,.59-1.643h0l-9.864.031.72,1.624Z" transform="translate(-0.28)"
          fill="#393b3c"></path>
        <path d="M70.719,33.748l0,0,2.541.073L65.35,25.9l-3.018-.56Z" transform="translate(-0.561 -0.07)"
          fill="#464749"></path>
        <path d="M54.6,24.184l.011-6.587,7.723,7.742,3.018.56L52.883,13.406v8.343l1.662,2.422Z"
          transform="translate(-0.561)" fill="#181a19"></path>
        <path d="M54.546,24.171l-1.662-2.422v.04l-7.558-1.641-.59,1.643Z" transform="translate(-0.373)" fill="#464749">
        </path>
        <path d="M40.429,64.306v2.315l.01.01L51.93,55.145l-1.867-.558Z" transform="translate(-0.34 -0.262)"
          fill="#46474a"></path>
        <path
          d="M73.258,33.823l-2.541-.073L65.68,38.832l-9.08,9.16-6.537,6.6,1.867.558,6.218-6.216,8.986-8.982,6.125-6.123Z"
          transform="translate(-0.561 -0.168)" fill="#46474a"></path>
        <path
          d="M40.429,64.306l-.042.042-9.621-9.691L24.187,48.03l-8.924-8.99-5.2-5.233L7.7,33.881l6.218,6.228,8.779,8.779,6.3,6.3,11.43,11.429Z"
          transform="translate(0 -0.262)" fill="#181a19"></path>
        <path
          d="M35.458,20.178H35.35L28.1,21.789v-.023l.107-8.4L15.692,25.887l2.745-.449,7.868-7.868L26.291,24.2l.11-.027L36.178,21.8Z"
          fill="#181a19"></path>
      </g>
    </symbol>
    <symbol viewBox="0 0 35.1 35.1" id="ico-google-plus">
      <path d="M17.5,0C7.9,0,0,7.9,0,17.5s7.9,17.5,17.5,17.5s17.5-7.9,17.5-17.5S27.2,0,17.5,0z M21,17.5
            c0,4.8-3.9,8.7-8.7,8.7c-4.8,0-8.7-3.9-8.7-8.7c0-4.8,3.9-8.7,8.7-8.7c2.1,0,4.1,0.8,5.7,2.1l-2.3,2.6c-0.9-0.8-2.1-1.3-3.4-1.3
            c-2.9,0-5.2,2.4-5.2,5.2s2.4,5.2,5.2,5.2c2.3,0,4.2-1.5,4.9-3.5h-4.9v-3.5H21V17.5z M28,17.5V21h-1.7v-3.5h-3.5v-1.7h3.5v-3.5H28
            v3.5h3.5v1.7H28z"></path>
    </symbol>
    <symbol viewBox="0 0 437.6 437.6" id="ico-help">
      <path
        d="m194 142.8c0.8 1.6 1.6 3.2 2.4 4.4s2 2.4 2.8 3.6c1.2 1.2 2.4 2.4 4 3.6 1.2 0.8 2.8 2 4.8 2.4 1.6 0.8 3.2 1.2 5.2 1.6s3.6 0.4 5.2 0.4 3.6 0 5.2-0.4 3.2-0.8 4.4-1.6h0.4c1.6-0.8 3.2-1.6 4.8-2.8 1.2-0.8 2.4-2 3.6-3.2l0.4-0.4c1.2-1.2 2-2.4 2.8-3.6s1.6-2.4 2-4c0-0.4 0-0.4 0.4-0.8 0.8-1.6 1.2-3.6 1.6-5.2s0.4-3.6 0.4-5.2 0-3.6-0.4-5.2-0.8-3.2-1.6-5.2c-1.2-2.8-2.8-5.2-4.8-7.2l-0.8-0.8c-1.2-1.2-2.4-2-4-3.2-1.6-0.8-2.8-1.6-4.4-2.4s-3.2-1.2-4.8-1.6c-2-0.4-3.6-0.4-5.2-0.4s-3.6 0-5.2 0.4-3.2 0.8-4.8 1.6h-0.4c-1.6 0.8-3.2 1.6-4.4 2.4-1.6 1.2-2.8 2-4 3.2s-2.4 2.4-3.2 3.6-1.6 2.8-2.4 4.4-1.2 3.2-1.6 4.8c-0.4 2-0.4 3.6-0.4 5.2s0 3.6 0.4 5.2c0.4 3.2 1.2 4.8 1.6 6.4z">
      </path>
      <path
        d="m249.6 289.2h-9.2v-98c0-5.6-4.4-10.4-10.4-10.4h-42c-5.6 0-10.4 4.4-10.4 10.4v21.6c0 5.6 4.4 10.4 10.4 10.4h8.4v66.4h-8.4c-5.6 0-10.4 4.4-10.4 10.4v21.6c0 5.6 4.4 10.4 10.4 10.4h61.6c5.6 0 10.4-4.4 10.4-10.4v-21.6c0-6-4.8-10.8-10.4-10.8z">
      </path>
      <path
        d="m218.8 0c-120.8 0-218.8 98-218.8 218.8s98 218.8 218.8 218.8 218.8-98 218.8-218.8-98-218.8-218.8-218.8zm0 408.8c-104.8 0-190-85.2-190-190s85.2-190 190-190 190 85.2 190 190-85.2 190-190 190z">
      </path>
    </symbol>
    <symbol viewBox="0 0 400 60" id="certificate-dot">
      <path d="M-1-1h582v402H-1z"></path>
      <g></g>
    </symbol>
    <symbol viewBox="0 0 451.8 451.8" id="ico-arrow-down">
      <path
        d="M225.9 354.7c-8.1 0-16.2-3.1-22.4-9.3L9.3 151.2c-12.4-12.4-12.4-32.4 0-44.8 12.4-12.4 32.4-12.4 44.7 0l171.9 171.9 171.9-171.9c12.4-12.4 32.4-12.4 44.7 0 12.4 12.4 12.4 32.4 0 44.8L248.3 345.4C242.1 351.6 234 354.7 225.9 354.7z">
      </path>
    </symbol>
    <symbol viewBox="0 0 36 36" id="ico-telegram">
      <path
        d="M18 35.6271C27.665 35.6271 35.5 27.7921 35.5 18.1271C35.5 8.46209 27.665 0.627075 18 0.627075C8.33502 0.627075 0.5 8.46209 0.5 18.1271C0.5 27.7921 8.33502 35.6271 18 35.6271Z">
      </path>
      <path
        d="M12.3459 19.4063L14.4222 25.153C14.4222 25.153 14.6818 25.6907 14.9597 25.6907C15.2377 25.6907 19.3719 21.3898 19.3719 21.3898L23.9693 12.51L12.42 17.9229L12.3459 19.4063Z">
      </path>
      <path
        d="M15.0989 20.8801L14.7003 25.116C14.7003 25.116 14.5335 26.4139 15.8311 25.116C17.1288 23.8181 18.3708 22.8172 18.3708 22.8172"
        fill="#f3f3f4"></path>
      <path
        d="M12.3834 19.6114L8.11256 18.2198C8.11256 18.2198 7.60214 18.0128 7.76649 17.5432C7.80033 17.4463 7.86858 17.3639 8.07274 17.2223C9.01906 16.5627 25.5882 10.6073 25.5882 10.6073C25.5882 10.6073 26.056 10.4497 26.332 10.5545C26.4002 10.5757 26.4616 10.6146 26.5099 10.6672C26.5582 10.7199 26.5917 10.7844 26.6068 10.8542C26.6367 10.9776 26.6491 11.1044 26.6439 11.2312C26.6426 11.3409 26.6293 11.4425 26.6192 11.6019C26.5183 13.2301 23.4984 25.3821 23.4984 25.3821C23.4984 25.3821 23.3177 26.0932 22.6704 26.1176C22.5113 26.1227 22.3528 26.0958 22.2043 26.0383C22.0559 25.9809 21.9205 25.8942 21.8063 25.7833C20.536 24.6906 16.1452 21.7398 15.175 21.0909C15.1531 21.0759 15.1347 21.0565 15.1209 21.0339C15.1072 21.0112 15.0985 20.9859 15.0953 20.9596C15.0818 20.8912 15.1562 20.8065 15.1562 20.8065C15.1562 20.8065 22.8016 14.0106 23.0051 13.2972C23.0208 13.242 22.9613 13.2147 22.8814 13.2389C22.3736 13.4257 13.5708 18.9847 12.5993 19.5982C12.5293 19.6194 12.4554 19.6239 12.3834 19.6114V19.6114Z"
        fill="#f3f3f4"></path>
    </symbol>
    <symbol viewBox="0 0 24 24" id="ico-pin">
      <g clip-path="url(#clip0_1009_1454)">
        <path d="M15 4.5L11 8.5L7 10L5.5 11.5L12.5 18.5L14 17L15.5 13L19.5 9" stroke="#37383D" stroke-width="1.75"
          stroke-linecap="round" stroke-linejoin="round"></path>
        <path d="M9 15L4.5 19.5" stroke="#37383D" stroke-width="1.75" stroke-linecap="round" stroke-linejoin="round">
        </path>
        <path d="M14.5 4L20 9.5" stroke="#37383D" stroke-width="1.75" stroke-linecap="round" stroke-linejoin="round">
        </path>
      </g>
      <defs>
        <clipPath id="clip0_1009_1454">
          <rect width="24" height="24" fill="white"></rect>
        </clipPath>
      </defs>
    </symbol>
  </svg>
  <HeaderLogin relative></HeaderLogin>
  <TabsComponent :sub=subjectsArray></TabsComponent>
  <main class="main" nmt>
    <div class="main__container">
      <div class="test-wrapper">
        <div class="test-content">
          <header class="test-header">
            <nav class="test-breadcrumbs">
              <a href="./" class="test-breadcrumb">Іспит</a>
              <span class="icon fa fa-angle-right" aria-hidden="true"></span>
              <a href="./" class="test-breadcrumb">{{ examTitle }}</a>
              <span class="icon fa fa-angle-right" aria-hidden="true"></span>
              <a href="./" class="test-breadcrumb">{{ examBlockTitle }}</a>
            </nav>

            <i class="fullscreen-button fs-expand" aria-hidden="true" id="fullscreen">
              <!-- <svg>
                            <use xlink:href="#ico-fs-expand"></use>
                          </svg> -->
            </i>
          </header>
          <main class="test">
            <div class="sequence-nav">
              <button class="sequence-nav-button button-previous" :class="{ disabled: activeTestIndex === 0 }"
                :disabled="activeTestIndex === 0" @click="setActiveBlock(0)">
                <span>
                  <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 24 24" fill="none"
                    class="injected-svg" data-src="https://cdn.hugeicons.com/icons/arrow-right-01-stroke-standard.svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink" role="img" color="#000000">
                    <path d="M9.00005 6L15 12L9 18" stroke="#000000" stroke-width="1.5" stroke-miterlimit="16"
                      stroke-linecap="round" stroke-linejoin="round"></path>
                  </svg>
                  <span class="sequence-nav-button-label">Назад</span>
                </span>


              </button>
              <button class="sequence-nav-button button-next" :class="{ disabled: activeTestIndex === 1 }"
                :disabled="activeTestIndex === 1" @click="setActiveBlock(1)">
                <span>
                  <span class="sequence-nav-button-label">Вперед</span> <svg xmlns="http://www.w3.org/2000/svg"
                    width="16" height="" viewBox="0 0 24 24" fill="none" class="injected-svg"
                    data-src="https://cdn.hugeicons.com/icons/arrow-right-01-stroke-standard.svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink" role="img" color="#000000">
                    <path d="M9.00005 6L15 12L9 18" stroke="#000000" stroke-width="1.5" stroke-miterlimit="16"
                      stroke-linecap="round" stroke-linejoin="round"></path>
                  </svg>

                </span>

              </button>
              <nav class="sequence-list-wrapper" aria-label="Послідовність">
                <ol id="sequence-list" role="tablist">
                  <li role="presentation" v-for="(block, blockIndex) in blocks">
                    <button @click="setActiveBlock(blockIndex)" class="seq_other nav-item tab "
                      :class="{ active: blockIndex === activeTestIndex }" role="tab" tabindex="0" aria-selected="true"
                      aria-expanded="true" aria-controls="seq_content" data-index="0"
                      data-id="block-v1:rg+r1+1+type@vertical+block@127b4b76224e4b3da6a908cdd880ad9e" data-element="1"
                      data-page-title="Демо іспит" data-path="Testdrive — 2025 > Testdrive — 2025 > Демо іспит"
                      data-graded="True" id="tab_0">
                      <span class="tab-text" title="Демо іспит">{{ subDict[block.s] }}</span>
                      <!-- <span class="check-circle is-hidden">
                        <span class="fa fa-check-circle" style="color:green" aria-hidden="true"></span>
                      </span>
                      <span class="bookmark-icon is-hidden">
                        <span class="fa fa-fw fa-bookmark" aria-hidden="true"></span>
                      </span> -->
                      <!-- <div class="sequence-tooltip sr"><span class="sr">other&nbsp;</span>Демо іспит<span class="sr bookmark-icon-sr">&nbsp;</span></div> -->
                    </button>
                  </li>
                </ol>
              </nav>
            </div>
            <h2>{{ activeTestTitle }} </h2>
            <br>
            <div class="questions-block" v-for="block in blocksQuestions[activeTestIndex]">
              <tbody v-if="block.t == 's'">
                <tr>
                  <td
                    style="padding: 10px;  border: 1px solid #c8c8c8; width: 100%; border-color: #e6e6e6; background-color: #fafafa; text-align: center;">
                    <span style="font-size: 14.0pt; font-weight:bold;">

                      Завдання {{ getTaskRange("s") }} мають по чотири чи п’ять варіантів
                      відповіді, з яких лише один правильний. Виберіть правильний, на Вашу думку, варіант відповіді
                      й натисніть курсором на значок <img height="28" width="26" src="/assets/img/1-4.png"
                        @dragstart.prevent style="align-self: center;" alt="">. Позначений Вами варіант відповіді <img
                        height="28" width="28" src="/assets/img/1_4.png" @dragstart.prevent alt=""> ЗБЕРЕЖІТЬ,
                      натиснувши курсором на кнопку під завданням.
                    </span>
                  </td>
                </tr>
              </tbody>
              <tbody v-if="block.t == 'st'">
                <tr>
                  <td
                    style="padding: 10px;  border: 1px solid #c8c8c8; width: 100%; border-color: #e6e6e6; background-color: #fafafa; text-align: center;">
                    <span style="font-size: 14.0pt; font-weight:bold;">
                      У завданнях {{ getTaskRange("st") }} до кожного з трьох фрагментів інформації, позначених цифрами,
                      доберіть один
                      правильний, на Вашу думку, варіант відповіді, позначений буквою. Для цього натисніть курсором на
                      нього, а потім

                      на порожнє поле навпроти інформації,
                      позначеної цифрою. Або натисніть курсором на варіант відповіді, позначений буквою, і перетягніть
                      його на порожнє поле навпроти інформації, позначеної цифрою.<br>Ви можете змінити дібраний варіант
                      відповіді: видаліть його, натиснувши курсором на значок <img height="25" width="24"
                        src="/assets/img/mt.png" alt="">. Виберіть новий варіант відповіді. Після остаточного вибору
                      ЗБЕРЕЖІТЬ відповідь,
                      натиснувши курсором на кнопку під завданням.
                    </span>
                  </td>
                </tr>
              </tbody>
              <tbody v-if="block.t == 'm'">
                <tr>
                  <td
                    style="padding: 10px;  border: 1px solid #c8c8c8; width: 100%; border-color: #e6e6e6; background-color: #fafafa; text-align: center;">
                    <span style="font-size: 14.0pt; font-weight:bold;">
                      Завдання {{ getTaskRange("m") }} мають по&nbsp;сім варіантів
                      відповіді, з яких лише ТРИ правильні. Виберіть правильні, на Вашу думку, варіанти
                      відповідей&nbsp;і натисніть курсором на значки&nbsp;<img height="28" width="28"
                        src="/assets/img/mtp.png" alt="">. Варіанти відповідей&nbsp;<img height="30" width="28"
                        src="/assets/img/mtp_.png" alt="">, позначені Вами, ЗБЕРЕЖІТЬ, натиснувши курсором на кнопку під
                      завданням.
                    </span>
                  </td>
                </tr>
              </tbody>


              <tbody v-if="block.t == 'sh'">
                <tr>
                  <td
                    style="padding: 10px;  border: 1px solid #c8c8c8; width: 100%; border-color: #e6e6e6; background-color: #fafafa; text-align: center;">
                    <span style="font-size: 14.0pt; font-weight:bold;">
                      Розв’яжіть завдання {{ getTaskRange("sh") }} Одержані числові відповіді впишіть у спеціальне поле. Відповіді записуйте лише
                            десятковим дробом. ЗБЕРЕЖІТЬ відповідь.
                          </span>
                  </td>
                </tr>
              </tbody>
              <br>
              <br>
              <div class="question"
                v-for="(question, qIndex) in allQuestions[activeTestIndex].filter(q => q.t === block.t)"
                :key="`${activeTestIndex}-${qIndex}`"
                :data-q="flatQuestions.find(q => q.q === question.q && q.t === question.t)?.globalIndex">
                <h3>Завдання {{flatQuestions.find(q => q.q === question.q && q.t === question.t)?.globalIndex + 1}}
                </h3>
                <p class="q-hash" v-html="String(md([activeTestIndex, qIndex].join('-'))).slice(6)"></p>
                <div>{{ question.q }}</div>
                <br />
                <pre v-if="devMode" class="dev">{{ question }}</pre>
                <div class="watermark" style="width: 260px; top: -160px;">92dcc 5831a 92dcc 5831a 92dcc 5831a </div>
                <SingleAnswerComponent v-if="question.t === 's'" :data="question.a" :savedAnswers="question.savedAnswer"
                  v-model="question.current"
                  @update="match => handleSingleUpdate(match, flatQuestions.find(q => q.q === question.q && q.t === question.t)?.globalIndex)" />

                <MultipleAnswersComponent v-else-if="question.t === 'm'" :data="question.a"
                  :savedAnswers="question.savedAnswer ? [...question.savedAnswer] : []" v-model="question.current"
                  @save="result => handleSave(result, qIndex)"
                  @update="matches => handleMultiUpdate(matches, flatQuestions.find(q => q.q === question.q && q.t === question.t)?.globalIndex)" />

                <DragNDropComponent v-else-if="question.t === 'st'" :data="question.a"
                  :savedAnswers="question.savedAnswer" v-model="question.current" @save="handleSave" />

                <ShortAnswerComponent v-else-if="question.t === 'sh'" :data="question.a"
                  :savedAnswers="question.savedAnswer" v-model="question.current"
                  @update="match => handleSingleUpdate(match, flatQuestions.find(q => q.q === question.q && q.t === question.t)?.globalIndex)" />

                <button v-if="question.t === 'st'" class="submit" :disabled="validSet(question)"
                  @click="saveAnswers(flatQuestions.find(q => q.q === question.q && q.t === question.t)?.globalIndex)">
                  Зберегти відповідь
                </button>
                <button v-else-if="question.t === 'sh'" class="submit"
                  :disabled="question.savedAnswer === question.current || question.current.trim() === ''"
                  @click="saveAnswers(flatQuestions.find(q => q.q === question.q && q.t === question.t)?.globalIndex)">
                  Зберегти відповідь
                </button>
                <button v-else class="submit" :disabled="question.savedAnswer === question.current"
                  @click="saveAnswers(flatQuestions.find(q => q.q === question.q && q.t === question.t)?.globalIndex)">
                  Зберегти відповідь
                </button>
                <br />
                <div v-if="question.saved" class="answer-saved">
                  <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24" fill="none"
                    class="injected-svg">
                    <path fill-rule="evenodd" clip-rule="evenodd"
                      d="M1.25 12C1.25 6.06294 6.06294 1.25 12 1.25C17.937 1.25 22.75 6.06293 22.75 12C22.75 17.937 17.937 22.75 12 22.75C6.06293 22.75 1.25 17.937 1.25 12ZM12.1949 10.0309C12.4605 10.0702 12.8087 10.1752 13.0735 10.4884C13.3659 10.7881 13.4444 11.1308 13.4743 11.3752C13.5002 11.5871 13.5001 11.8365 13.5 12.0602L13.5 12.1V16.5C13.5 17.0523 13.0523 17.5 12.5 17.5C11.9477 17.5 11.5 17.0523 11.5 16.5V12.1L11.5 12C10.9477 12 10.5 11.5523 10.5 11C10.5 10.4477 10.9477 10 11.5 10L11.5408 9.99999H11.5408C11.739 9.99983 11.9835 9.99964 12.1949 10.0309ZM12 7C11.4477 7 11 7.44772 11 8C11 8.55228 11.4477 9 12 9H12.0001C12.5524 9 13.0001 8.55228 13.0001 8C13.0001 7.44772 12.5524 7 12.0001 7H12Z"
                      fill="var(--nmt)">
                    </path>
                  </svg>
                  <p>Відповідь збережено {{ getRelativeTime(question.savedAt) }}</p>
                </div>
                <div v-if="question.warn && question.t==='m'" class="answer-saved warn" style="margin-top: 1rem !important">
                  
                  <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24" fill="none"
                    class="injected-svg">
                    <path fill-rule="evenodd" clip-rule="evenodd"
                      d="M1.25 12C1.25 6.06294 6.06294 1.25 12 1.25C17.937 1.25 22.75 6.06293 22.75 12C22.75 17.937 17.937 22.75 12 22.75C6.06293 22.75 1.25 17.937 1.25 12ZM12.1949 10.0309C12.4605 10.0702 12.8087 10.1752 13.0735 10.4884C13.3659 10.7881 13.4444 11.1308 13.4743 11.3752C13.5002 11.5871 13.5001 11.8365 13.5 12.0602L13.5 12.1V16.5C13.5 17.0523 13.0523 17.5 12.5 17.5C11.9477 17.5 11.5 17.0523 11.5 16.5V12.1L11.5 12C10.9477 12 10.5 11.5523 10.5 11C10.5 10.4477 10.9477 10 11.5 10L11.5408 9.99999H11.5408C11.739 9.99983 11.9835 9.99964 12.1949 10.0309ZM12 7C11.4477 7 11 7.44772 11 8C11 8.55228 11.4477 9 12 9H12.0001C12.5524 9 13.0001 8.55228 13.0001 8C13.0001 7.44772 12.5524 7 12.0001 7H12Z"
                      fill="#e2c01f">
                    </path>
                  </svg>
                  <p>Ви позначили НЕ всі відповіді до цього завдання</p>
                </div>
                <div v-if="question.warn && question.t==='sh'" class="answer-saved warn" style="margin-top: 1rem !important">
                  
                  <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24" fill="none"
                    class="injected-svg">
                    <path fill-rule="evenodd" clip-rule="evenodd"
                      d="M1.25 12C1.25 6.06294 6.06294 1.25 12 1.25C17.937 1.25 22.75 6.06293 22.75 12C22.75 17.937 17.937 22.75 12 22.75C6.06293 22.75 1.25 17.937 1.25 12ZM12.1949 10.0309C12.4605 10.0702 12.8087 10.1752 13.0735 10.4884C13.3659 10.7881 13.4444 11.1308 13.4743 11.3752C13.5002 11.5871 13.5001 11.8365 13.5 12.0602L13.5 12.1V16.5C13.5 17.0523 13.0523 17.5 12.5 17.5C11.9477 17.5 11.5 17.0523 11.5 16.5V12.1L11.5 12C10.9477 12 10.5 11.5523 10.5 11C10.5 10.4477 10.9477 10 11.5 10L11.5408 9.99999H11.5408C11.739 9.99983 11.9835 9.99964 12.1949 10.0309ZM12 7C11.4477 7 11 7.44772 11 8C11 8.55228 11.4477 9 12 9H12.0001C12.5524 9 13.0001 8.55228 13.0001 8C13.0001 7.44772 12.5524 7 12.0001 7H12Z"
                      fill="#e2c01f">
                    </path>
                  </svg>
                  <p>Ваш запис не коректний. Упишіть число</p>
                </div>
              </div>
            </div>
            <br>
            <br>
            <div class="sequence-nav bottom">
              <button class="sequence-nav-button button-previous" :class="{ disabled: activeTestIndex === 0 }"
                :disabled="activeTestIndex === 0" @click="setActiveBlock(0)">
                <span class="tab-text">
                  <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 24 24" fill="none"
                    class="injected-svg" data-src="https://cdn.hugeicons.com/icons/arrow-right-01-stroke-standard.svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink" role="img" color="#000000">
                    <path d="M9.00005 6L15 12L9 18" stroke="#000000" stroke-width="1.5" stroke-miterlimit="16"
                      stroke-linecap="round" stroke-linejoin="round"></path>
                  </svg>
                  <span class="sequence-nav-button-label">Назад</span>
                </span>
              </button>
              <button class="sequence-nav-button button-next" :class="{ disabled: activeTestIndex === 1 }"
                :disabled="activeTestIndex === 1" @click="setActiveBlock(1)">
                <span class="tab-text">
                  <span class="sequence-nav-button-label">Вперед</span> <svg xmlns="http://www.w3.org/2000/svg"
                    width="20" height="20" viewBox="0 0 24 24" fill="none" class="injected-svg"
                    data-src="https://cdn.hugeicons.com/icons/arrow-right-01-stroke-standard.svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink" role="img" color="#000000">
                    <path d="M9.00005 6L15 12L9 18" stroke="#000000" stroke-width="1.5" stroke-miterlimit="16"
                      stroke-linecap="round" stroke-linejoin="round"></path>
                  </svg>
                </span>
              </button>
            </div>
          </main>
        </div>
        <div class="test-nav">
          <h3 class="side-navigation-title">Завдання</h3>
          <div class="side-navigation-items js-task-list">
            <a class="task-block " :data-a="index" v-for="(question, index) in allQuestions[activeTestIndex]"
              :key="index" @click="scrollTo(index)"
              :class="{ active: currentQuestion === index, 'submitted': question.saved === true, 'not-viewed': !Array.from(viewed[activeTestIndex]).includes(index) }">
              <span>{{ index + 1 }}</span>
            </a>
          </div>
        </div>
      </div>
    </div>
  </main>
  <br>
  <footer class="wrapper wrapper-footer">
    <div class="holder">
      <div class="footer-holder">
        <div class="partner-item">
          <img src="/assets/img/logo_small.webp" alt="" @dragstart.prevent style="width: 100px">
        </div>
      </div>
    </div>
  </footer>
</template>
<script setup>
import { ref, reactive, computed, onMounted, onBeforeUnmount, watch, nextTick } from 'vue'
import TabsComponent from './components/TabsComponent.vue'
import HeaderLogin from '@/components/nmt/HeaderLogin.vue'
import DragNDropComponent from './questions/DragNDropComponent.vue'
import SingleAnswerComponent from './questions/SingleAnswerComponent.vue'
import ShortAnswerComponent from './questions/ShortAnswerComponent.vue'
import MultipleAnswersComponent from './questions/MultipleAnswersComponent.vue'
import { useHead } from '@vueuse/head'
import('https://cdn.jsdelivr.net/npm/@thumbmarkjs/thumbmarkjs/dist/thumbmark.umd.js')
  .then(() => {
    ThumbmarkJS.getFingerprint().then((fp) => { console.log(fp) })
  })

const devMode = ref(false)
const isComplete = ref([])
const examTitle = ref("Національний мультипредметний тест")
const examBlockTitle = ref("НМТ")
const STORAGE_KEY = btoa('saved-questions')
const blockLoaded = ref(false)
const globalQCounter = ref(0)
const blocksQuestions = ref([
  [{
    t: "s",
    questions: [
      { q: "Яке зe чисел є простим?", a: ["4", "6", "7", "9"] },
      { q: "Чому дорівнює 5 + 7?", a: ["10", "11", "12", "13"] },
      { q: "Яке число є квадратом іншого?", a: ["5", "7", "16", "13"] }
    ]
  },
  {
    t: "m",
    questions: [
      { t: "m", q: "Виберіть всі парні числа:", a: ["3", "8", "12", "7"] },
      { q: "Позначте кратні числу 3:", a: ["3", "6", "9", "10"] }
    ]
  },
  {
    t: "sh",
    questions: [
      { q: "Скільки буде 12 * 12?", a: [] },
      { q: "Скільки буде 8 * 9?", a: [] },
      { q: "Скільки буде 2³?", a: [] },
      { q: "Скільки будrerе 12 * 12?", a: [] },
      { q: "Скільки бrwqуде 8 * 9?", a: [] },
      { q: "Скільки будrwqе 2³?", a: [] }
    ]
  },
  {
    t: "st",
    questions: [
      {
        q: "Співвіднесіть математиків з їх відкриттями:",
        a: [["Евклід", "Піфагор", "Архімед", "Ньютон"], ["Геометрія", "Теорема", "Закон важеля", "Гравітація"]]
      },
      {
        q: "Співвіднесіть формулу з її описом:",
        a: [["a² + b² = c²", "F = ma", "V = IR", "E = mc²"], ["Закон Піфагора", "Другий закон Ньютона", "Закон Ома", "Рівняння Ейнштейна"]]
      },
      {
        q: "Співвідasнесіть математиків з їх відкриттями:",
        a: [["Евклід", "Піфагор", "Архімед", "Ньютон"], ["Геометрія", "Теорема", "Закон важеля", "Гравітація"]]
      },
      {
        q: "Співвfsaіднесіть формулу з її описом:",
        a: [["a² + b² = c²", "F = ma", "V = IR", "E = mc²"], ["Закон Піфагора", "Другий закон Ньютона", "Закон Ома", "Рівняння Ейнштейна"]]
      }
    ]
  }], [{
    t: "s",
    questions: [
      { q: "Яке wqrwз чисел є простим?", a: ["4", "6", "7", "9"] },
      { q: "Чомrqwrqwrу дорівнює 5 + 7?", a: ["10", "11", "12", "13"] },
      { q: "Якrwqrqwrе число є квадратом іншого?", a: ["5", "7", "16", "13"] }
    ]
  },
  {
    t: "m",

    questions: [
      { q: "Виrqwrберіть всі парні числа:", a: ["3", "8", "12", "7"] },
      { q: "Пrqwrqwrозначте кратні числу 3:", a: ["3", "6", "9", "10"] }
    ]
  },
  {
    t: "sh",
    questions: [
      { q: "Скrqwrqwільки буде 12 * 12?", a: [] },
      { q: "Сrqwrwqrкільки буде 8 * 9?", a: [] },
      { q: "Сrqwrqwrкільки буде 2³?", a: [] }
    ]
  },
  {
    t: "st",
    questions: [
      {
        q: "Співвіднесіть математиків з їх відкриттями:",
        a: [["Евклід", "Піфагор", "Архімед", "Ньютон"], ["Геометрія", "Теорема", "Закон важеля", "Гравітація"]]
      },
      {
        q: "Співвіднесіть формулу з її описом:",
        a: [["a² + b² = c²", "F = ma", "V = IR", "E = mc²"], ["Закон Піфагора", "Другий закон Ньютона", "Закон Ома", "Рівняння Ейнштейна"]]
      }
    ]
  }]
]);

const allQuestions = ref(blocksQuestions.value.map(block =>
  block.flatMap(section =>
    section.questions.map(question => ({
      t: section.t,
      q: question.q,
      a: question.a,
      current: null,
      saved: false,
      savedAnswer: null,
      savedAt: null,
      ...(section.t === 's' || section.t === 'm' ? { c: 0 } : {})
    }))
  )
))
function getBlockQuestionsCount() {
  let count = 0
  blocksQuestions.value[activeTestIndex.value].forEach(e => {
    count += e.questions.length
  })
  return count
}

const getTaskRange = (blockType) => {
  const questions = allQuestions.value[activeTestIndex.value].filter(q => q.t === blockType);
  if (!questions.length) return '';
  const indices = questions
    .map(q => flatQuestions.value.find(fq => fq.q === q.q && fq.t === q.t)?.globalIndex)
    .filter(index => index !== undefined)
    .sort((a, b) => a - b);
  if (!indices.length) return '';
  const start = indices[0] + 1; // Add 1 for 1-based indexing
  const end = indices[indices.length - 1] + 1;
  return start === end ? start : `${start}–${end}`;
};
const currentBlockQuestions = ref(null)
// }
const currentQuestion = ref(0)
const activeTestIndex = ref(0)
const activeTestTitle = ref("")
const viewed = ref([new Set(), new Set()])
const viewedQuestionsPerTest = reactive([]);

watch(() => activeTestIndex, () => {
  globalQCounter.value = 0
})

const flatQuestions = computed(() => {
  let index = 0
  return blocksQuestions.value[activeTestIndex.value].flatMap(block =>
    block.questions.map(question => ({
      ...question,
      t: block.t,
      message: block.message,
      globalIndex: index++
    }))
  )
})

let observer;

function md(a) {
  return md5(a).slice(8)
}

function validSet(q) {

  if (q.current == null) return true
  if (q.current.includes(null)) return true
  if (q.current && q.savedAnswer) return q.current === q.savedAnswer
  if (q.type == "st") {
    if (q.current.includes(null)) return false;
    else if (!Array.isArray(q.current) || !Array.isArray(q.savedAnswer)) return false;
    else return JSON.stringify(q.current) === JSON.stringify(q.savedAnswer);
  }
  else return JSON.stringify(q.current) === JSON.stringify(q.savedAnswer);
}

async function setActiveBlock(blockIndex) {
  activeTestIndex.value = blockIndex;
  // loadCurrentBlockQuestions();
  // isComplete.value = currentBlockQuestions.value.map(() => false);

  await nextTick();

  observer.disconnect();

  if (blockLoaded.value) {
    window.scrollTo({ top: 0, behavior: 'auto' });


  } else {
    blockLoaded.value = true
  }


  createObserver();

  await nextTick();
  document.querySelectorAll('[data-q]').forEach(el => observer.observe(el));

  currentQuestion.value = 0

}

const blocks = ref([{ "s": "h" }, { "s": "b" }])
const subjectsArray = ref(blocks.value.map(e => e.s))
const subDict = ref({ "m": "Математика", "u": "Українська мова", "h": "Історія України", "p": "Фізика", "c": "Хімія", "b": "Біологія", "d": "Німецька мова", "es": "Іспанська мова" })
if (localStorage.getItem(STORAGE_KEY)) {

  const saved = localStorage.getItem(STORAGE_KEY)


  try {
    const parsed = JSON.parse(saved)
    questions.value = parsed

  } catch (e) {
    console.error("Failed to parse saved questions:", e)

  }

  setActiveBlock(0)

} else {
  setActiveBlock(0)
}

// watch(activeTestIndex, () => {
//   loadCurrentBlockQuestions()
// })



function saveToLocalStorage() {
  const obj = JSON.stringify(questions.value, (_, value) => {
    if (value && typeof value === 'object' && !Array.isArray(value)) {
      return Object.keys(value).sort().reduce((sorted, key) => {
        sorted[key] = value[key]
        return sorted
      }, {})
    }
    return value
  }, 2)

  localStorage.setItem(STORAGE_KEY, obj)

}

function saveAnswers(index) {

  console.log(index)
  const question = allQuestions.value[activeTestIndex.value][index];
  if (!question) return;

  console.log(question)

  if (question.t === "m") {
    delete question.warn;
    if (question.current.length < 3) {
      console.log("warn")
        question.warn = true
        setTimeout(() => {
      delete question.warn; // Remove warn property entirely
    }, 3000);

    return;
    }
  }


  console.log("Saving answer...");

  let savedAnswer = "";

  if (question.t === "sh") {
    delete question.warn
    const inputEl = document.querySelector(`[data-q="${index}"] .short-answer input`);
    if (inputEl) {
      savedAnswer = inputEl.value ?? "";
      if (isNaN(Number(savedAnswer))) {  
        question.warn = true

        setTimeout(() => {
          delete question.warn
        }, 3000)
        return
      }
   
      const existingListener = inputEl._onInputChange;
      if (existingListener) {
        inputEl.removeEventListener("input", existingListener);
      }

      const onInputChange = () => {
        inputEl.classList.remove("saved");
        if (inputEl.value !== question.savedAnswer) {
          inputEl.classList.remove("saved");
        } else {
          inputEl.classList.add("saved");
        }
      };

      inputEl._onInputChange = onInputChange;
      inputEl.addEventListener("input", onInputChange);

      const submitButton = document.querySelector(`[data-q="${index}"] button.submit`);
      submitButton?.setAttribute("disabled", true);
     
    }
  } else {
    // For non-text questions, use .c (selected choice, etc.)
    savedAnswer = question.current ?? "";
  }

  // Save locally
  question.savedAnswer = savedAnswer;
  question.savedTime = new Date();
  question.saved = true;


  isComplete.value[index] = false;

  // Save sorted to localStorage
  // const obj = JSON.stringify(allQuestions.value, (_, value) => {
  //   if (value && typeof value === "object" && !Array.isArray(value)) {
  //     return Object.keys(value)
  //       .sort()
  //       .reduce((sorted, key) => {
  //         sorted[key] = value[key];
  //         return sorted;
  //       }, {});
  //   }
  //   return value;
  // }, 2);

  // localStorage.setItem(STORAGE_KEY, obj);
}



function handleSave(result, index) {
  const question = questions.value[activeTestIndex.value][index]

  question.savedAnswer = result
  question.s = result    // update saved answer too
  question.saved = true
  question.savedTime = new Date()
  isComplete.value[index] = false  // saved, so not incomplete
  saveToLocalStorage()

  console.log(`Збережено для ${index + 1}:`, result)
}


function handleSingleUpdate(match, index) {
  const question = allQuestions.value[activeTestIndex.value][index]
  if (!question) {
    console.warn(`Question at index ${index} not found`)
    return
  }

  question.current = match

  const isAnswered = match !== null && match !== ''
  const isSameAsSaved = question.s === match

  isComplete.value[index] = isAnswered && !isSameAsSaved

  // saveToLocalStorage()
}

function handleMultiUpdate(matches, index) {
  console.log("dsf")
  const question = allQuestions.value[activeTestIndex.value][index]
  if (!question) {
    console.warn(`Question at index ${index} not found`)
    return
  }

  question.current = matches

  const allAnswered = matches.length > 0
  const isSameAsSaved = JSON.stringify(question.current) === JSON.stringify(question.s)

  isComplete.value[index] = allAnswered && !isSameAsSaved

  // saveToLocalStorage()
}

function getRelativeTime(date) {
  if (!date) return '';

  const seconds = Math.floor((new Date() - new Date(date)) / 1000);

  if (seconds < 60) return 'декілька секунд тому';
  if (seconds < 120) return 'хвилину тому';

  const minutes = Math.floor(seconds / 60);
  if (minutes < 60) return `${minutes} ${pluralize(minutes, 'хвилина', 'хвилини', 'хвилин')} тому`;

  const hours = Math.floor(seconds / 3600);
  if (hours < 2) return 'годину тому';
  if (hours < 24) return `${hours} ${pluralize(hours, 'година', 'години', 'годин')} тому`;

  return new Date(date).toLocaleString('uk-UA');
}

function pluralize(number, one, few, many) {
  const n = Math.abs(number);
  const lastDigit = n % 10;
  const lastTwoDigits = n % 100;

  if (lastDigit === 1 && lastTwoDigits !== 11) return one;
  if ([2, 3, 4].includes(lastDigit) && ![12, 13, 14].includes(lastTwoDigits)) return few;
  return many;
}

onMounted(() => {
  observer = new IntersectionObserver(
    (entries) => {
      entries.forEach(entry => {
        if (entry.isIntersecting) {
          const index = Number(entry.target.dataset.q);
          currentQuestion.value = index;
        }
      });
    },
    {
      root: null,
      rootMargin: '0px 0px -70% 0px',
      threshold: 0.1
    }
  );

  document.querySelectorAll('[data-q]').forEach(el => observer.observe(el));
});


onBeforeUnmount(() => {
  if (observer) observer.disconnect();
});

onBeforeUnmount(() => {
  clearInterval(interval)
})

function scrollTo(i) {
  const element = document.querySelector(`[data-q="${i}"]`);
  console.log(element);
  element.classList.remove("not-viewed")
  console.log(element.classList)
  if (element) {
    element.scrollIntoView({ behavior: 'smooth', block: 'start' });
  }
}


window.addEventListener("scroll", () => {
  viewed.value[activeTestIndex.value].add(currentQuestion.value)
  document.querySelector(`[data-a="${currentQuestion.value}"]`).classList.remove("not-viewed")
  console.log(viewed.value)
})


function createObserver(activeTestIndex) {
  if (observer) observer.disconnect();

  if (!viewedQuestionsPerTest[activeTestIndex]) {
    viewedQuestionsPerTest[activeTestIndex] = new Set();
  } console.clear()
  console.log(viewedQuestionsPerTest)
  observer = new IntersectionObserver(
    (entries) => {
      entries.forEach(entry => {
        if (entry.isIntersecting) {
          const index = Number(entry.target.dataset.q);
          currentQuestion.value = index;
        }
      });
    },
    {
      root: null,
      rootMargin: '0px 0px -80% 0px',
      threshold: 0.1
    }
  );
}

onMounted(async () => {
  createObserver();
  await nextTick();

  document.querySelectorAll('[data-q]').forEach(el => observer.observe(el));
});

onBeforeUnmount(() => {
  if (observer) observer.disconnect();
});


</script>
